<template>
	<div class="set">
		<div class="set__top">
			<div class="set__tab" :class="{ 'active': tabs.active == 1 }" @click="tabs.active = 1">
				Гарантии
			</div>
			<div class="set__tab" :class="{ 'active': tabs.active == 2 }" @click="tabs.active = 2">
				Сервис
			</div>
			<div class="set__tab" :class="{ 'active': tabs.active == 3 }" @click="tabs.active = 3">
				Условия кредитования
			</div>
			<div class="set__tab" :class="{ 'active': tabs.active == 4 }" @click="tabs.active = 4">
				О нас
			</div>
		</div>
		<div class="desc" :class="{ 'active': tabs.active == 1 }">
			<div class="container">
				<div class="desc__top">
					<div class="desc__title h1 _bold mh3">
						Гарантия на все автомобили
					</div>
					<div class="desc__text decked mtag">
						On-Line Dealer предоставляет гарантию на все продаваемые автомобили и защищает покупателя от неожиданных
						поломок
						после покупки, <br>а также обеспечивает:
					</div>
				</div>
				<div class="desc__params">
					<div class="desc__row">
						<div class="desc__el">
							<div class="el__icon"><img src="/img/gar1.svg" alt=""></div>
							<div class="el__title h4 _bold">Ремонт</div>
							<div class="el__text p1"> В авторизированном сервисном центре</div>
						</div>
						<div class="desc__el">
							<div class="el__icon"><img src="/img/gar2.svg" alt=""></div>
							<div class="el__title h4 _bold">Обслуживание</div>
							<div class="el__text p1">Комфортно и быстро через дилерскую сеть</div>
						</div>
						<div class="desc__el">
							<div class="el__icon"><img src="/img/gar3.svg" alt=""></div>
							<div class="el__title h4 _bold">Гарантия</div>
							<div class="el__text p1">Только оригинальные запчасти при ремонте*</div>
						</div>
						<div class="desc__el">
							<div class="el__icon"><img src="/img/gar4.svg" alt=""></div>
							<div class="el__title h4 _bold">Официально</div>
							<div class="el__text p1"> В соответствии <br>с технологией</div>
						</div>
					</div>
					<div class="desc__small">
						*при наличии. В случае отсутствия оригинальных запасных частей, могут быть использованы аналоги. Использование аналогов должно быть предварительно согласовано с Администратором.
					</div>
				</div>
				<div class="desc__opener">
					<div class="desc__opener-title h6 _bold">
						Перечень входящих в программу элементов транспортного средства
					</div>
					<div class="desc__opener-text">
						Все механические и электрические компоненты автомобиля, за исключением:
						<ul>
							<li> Свечи зажигания </li>
							<li> Приводные ремни вспомогательных агрегатов</li>
							<li> Система выпуска отработавших газов включая сажевый фильтр и каталитический нейтрализатор</li>
							<li> Фрикционные накладки дисков сцепления</li>
							<li> Тормозные колодки</li>
							<li> Накладки и диски</li>
							<li> Осветительные приборы, включая ксеноновые, галогенные лампы и светодиодные (LED) лампы</li>
							<li> Фара в сборе (за исключением ремкомплекта и восстановления фары)</li>
							<li> Предохранители</li>
							<li> АКБ</li>
							<li> Лакокрасочное покрытие</li>
							<li> Панели кузова</li>
							<li> Внешняя и внутренняя металлическая и декоративная отделка</li>
							<li> Внешние и внутренние уплотнители кузова и окон</li>
							<li> Ручки, упоры и петли</li>
							<li> Косметическая отделка</li>
							<li> Ковровое покрытие и внутренняя отделка и обивка</li>
							<li> Остекление</li>
							<li> Щетки стеклоочистителей</li>
							<li> Шины и колесные диски</li>
							<li> Балансировка и развал-схождение колес</li>
							<li> Элементы электрооборудования салона (включая, но не ограничиваясь - система подогрева и вентиляции
								сидений, электромоторы, электронные блоки и выключатели регулировки сидений, датчики слепых зон (зеркала)
							</li>
							<li> Камеры кругового обзора</li>
							<li> Датчики дождя и света, электропроводка салона автомобиля)</li>
							<li> Элементы подвески, ходовой части и рулевого управления (включая, но не ограничиваясь – сайлентблоки и
								резинометаллические шарниры рычагов подвески, рулевые тяги и втулки стабилизатора поперечной устойчивости,
								шаровые опоры)</li>
							<li> Течи и запотевания любых жидкостей вызванных износом сальников, прокладок и других уплотнительных
								элементов</li>
							<li> Плановое техобслуживание и регламентные и регулировочные работы</li>
							<li> Постепенное снижение эксплуатационных характеристик автомобиля, вызванное возрастом и пробегом.</li>
						</ul>
					</div>
				</div>
			</div>
		</div>
		<div class="desc" :class="{ 'active': tabs.active == 2 }">
			<div class="container">
				<div class="desc__top">
					<div class="desc__title h1 _bold mh3">
						Удобный сервис оценки и выкупа Вашего автомобиля
					</div>
					<div class="desc__text decked mtag">
						On-Line Dealer предоставляет своим клиентам качественный и удобных сервис выкупа автомобилей и услуги
						Трейд-ин. Мы постарались сделать процесс покупки нового автомобиля максимально комфортным, даже если Вы решили
						для этого продать свой поддержанный автомобиль
					</div>
				</div>
				<div class="desc__opener">
					<div class="desc__opener-title h6 _bold">
						Преимущества работы с нами:
					</div>
					<div class="desc__opener-text">
						<ul>
							<li>Большое количество комфортных офисов поблизости от Вас </li>
							<li>Выездной сервис осмотра автомобиля </li>
							<li>Максимальная рыночная оценка Вашего автомобиля </li>
							<li>Прозрачность финансовых расчётов </li>
							<li>Заслуженная репутация на рыке </li>
							<li>Профессиональные сотрудники </li>
							<li>Выплата наличными или переводом на Ваш счет </li>
							<li>Такси сервис </li>
						</ul>
					</div>
				</div>
				<div class="desc__opener">
					<div class="desc__opener-title h6 _bold">
						Перечень входящих в программу элементов транспортного средства:
					</div>
					<div class="desc__opener-text">
						<ul>
							<li>Паспорт РФ;</li>
							<li>Паспорт транспортного средства (ПТС);</li>
							<li>Свидетельство о регистрации ТС (СТС, заламинированный документ).</li>
						</ul>
						<div class="tag ptag desc__small">* мы можем запросить дополнительные документы если Вы не являетесь
							собственником,
							автомобиль в залоге у банка, автомобиль оформлен на юридическое лицо, автомобиль с электронным ПТС.</div>
					</div>
				</div>
			</div>
		</div>
		<div class="desc" :class="{ 'active': tabs.active == 3 }">
			<div class="container">
				<div class="desc__top">
					<div class="desc__title h1 _bold mh3">
						Выгодные условия кредита
					</div>
					<div class="desc__text decked mtag">
						On-line Dealer автомобилей предоставляет возможность купить автомобиль в кредит на максимально выгодных для
						Вас условиях. В настоящее время в числе наших партнёров наиболее финансово устойчивые организации. Это
						обеспечивает ряд дополнительных преимуществ, в числе которых – продажа автомобилей в кредит по привлекательным
						ценам, кратчайшие сроки и простота оформления сделки.
					</div>
					<div class="desc__text decked mtag">
						Обратившись к нам, Вы получите уникальную возможность выбрать не только банк, который предоставит
						финансирование, но и кредитную программу, оптимально соответствующую Вашим требованиям. Это позволяет
						приобрести
						понравившийся Вам автомобиль с минимальной нагрузкой на бюджет.
					</div>
				</div>
				<div class="desc__opener">
					<div class="desc__opener-title h6 _bold">
						Условия кредитования автомобиля:
					</div>
					<div class="desc__opener-text">
						<ul>
							<li>Первоначальный взнос не обязательный </li>
							<li>Срок кредита: от 13 до 96 месяцев </li>
							<li>Сумма финансирования: до 7 000 000 рублей </li>
							<li>Кредит по 2-м документам </li>
							<li>На любые цели или покупку авто </li>
							<li>Выпуск и обслуживание дебетовой Умной карты бесплатно на весь срок </li>
						</ul>
					</div>
				</div>
				<div class="desc__opener">
					<div class="desc__opener-title h6 _bold">
						Преимущества сотрудничества с On-Line Dealer:
					</div>
					<div class="desc__opener-text">
						<ul>
							<li>Минимум формальностей при оформлении сделки</li>
							<li>Большой выбор кредитных программ</li>
							<li>Удобный формат коммуникаций с банком через мобильное приложение</li>
							<li>Высокий % одобрения</li>
							<li>Приём заявок на покупку автомобилей в кредит в on-line формате</li>
							<li>Большое количество офисов обслуживания</li>
							<li>Поддержка клиентов 24 часа</li>
						</ul>
					</div>
				</div>
				<div class="desc__bank">
					<div class="h4 _bold desc__bank-title">Наш Банк-партнер:</div>
					<div class="desc__svg">
						<svg width="588" height="125" viewBox="0 0 588 125" fill="none" xmlns="http://www.w3.org/2000/svg">
							<g clip-path="url(#clip0_335_2698)">
								<path
									d="M0 62.4712C0 96.9023 27.8687 124.942 62.058 124.942C96.2474 124.942 124.116 96.9023 124.116 62.4712C124.116 28.0401 96.3049 0 62.058 0C27.8112 0 0 28.0401 0 62.4712ZM2.12606 62.4712C2.12606 29.1916 29.0179 2.13035 62.058 2.13035C95.0982 2.13035 121.99 29.1916 121.99 62.4712C121.99 95.7508 95.1557 122.812 62.058 122.812C28.9604 122.812 2.12606 95.7508 2.12606 62.4712ZM19.3644 45.3708C35.2237 34.8918 52.7493 28.7886 82.5142 33.9705C84.1806 32.9917 85.0425 32.1281 85.5022 30.1704C78.0897 27.4643 70.0451 26.5431 59.5872 26.7158C50.221 27.0037 33.3849 30.4583 24.3635 35.813L27.1217 32.3584C33.4424 28.6734 49.8188 23.7218 62.058 23.4339C70.7347 23.2612 75.2167 23.7794 85.5022 26.5431C84.5828 24.7582 82.4568 23.8945 79.3539 22.4551C69.3556 17.9641 50.7382 17.561 35.511 24.2976C37.5221 22.9157 39.5907 21.7066 41.7743 20.6702C46.8308 18.3671 55.0478 16.1216 65.3333 16.2943C73.5503 16.4095 83.3187 19.2883 89.2946 25.2764C90.1565 26.2552 90.7886 27.4643 91.1334 28.731C95.8452 31.1492 98.6033 33.3947 100.155 36.1009C100.844 37.5403 101.017 39.0949 100.787 40.6495C102.338 41.5131 103.66 42.7222 104.694 44.1617C105.384 45.1981 105.843 46.3496 106.073 47.6163C106.303 49.1133 106.418 50.783 104.867 52.7407C106.476 53.5467 107.74 55.7923 107.97 56.7711C108.716 60.3409 106.418 63.8531 103.373 66.5592C99.9249 69.6108 92.2252 73.2957 85.9619 74.9079C73.5503 78.0746 62.5752 79.3989 53.8411 81.011C59.7021 82.5081 65.7356 83.2566 71.769 83.2566C90.3289 83.2566 106.705 74.4473 106.705 74.4473C106.705 74.4473 106.361 75.5988 105.958 76.6352C94.1788 83.7748 75.4465 86.8263 67.4594 86.4809C60.1044 86.193 52.8068 84.9839 45.7965 82.7959C43.7279 83.3141 41.7168 84.0051 39.7631 84.8687C49.9337 89.5325 57.6335 90.5689 66.3676 91.2022C75.2167 91.8356 89.9267 89.7052 102.338 85.1566C101.764 85.7324 101.476 86.6536 100.902 87.1718C94.5236 90.5113 81.1351 93.9083 74.3547 94.1962C67.5743 94.4841 59.4148 94.1962 52.3471 92.8719C46.1988 91.6628 41.1996 89.7052 35.9707 87.4021C35.1088 88.0355 34.5342 88.9567 34.3618 90.0507C54.7605 100.818 73.9525 101.048 95.7303 94.1962L93.7191 96.1538C69.7578 105.942 51.0255 102.142 36.4878 95.0599C35.9707 94.8296 35.511 94.5993 34.9938 94.3689C36.3154 96.7296 47.4055 104.848 59.8171 105.884C68.3788 106.575 78.7792 105.136 84.985 102.66L81.365 104.56C74.4697 107.784 66.8848 109.224 59.3574 108.648C44.5899 107.669 36.258 101.048 32.523 97.5933C30.7992 95.9811 29.9947 94.0811 29.4776 91.8356C26.1448 90.0507 24.0188 88.2658 22.2949 85.5021C21.2606 83.8899 21.4905 82.105 21.7203 80.608C21.7778 80.1474 21.8927 79.6868 22.1225 79.2837C20.5136 78.1322 18.9047 76.8655 18.2152 75.5988C16.7787 72.9502 17.6406 70.6472 18.6749 68.9198C17.813 68.0562 17.1234 67.0198 16.6063 65.8683C16.2615 64.6591 16.1466 63.45 16.2615 62.1833C16.6637 59.9378 17.698 57.8075 19.2495 56.1377C22.4099 52.3952 27.4664 49.4588 36.2005 46.5799C44.7048 43.7586 48.1524 43.298 54.5306 41.801C62.0006 40.0737 71.022 39.4979 78.4919 36.8494C57.5761 33.1644 35.8558 36.5039 18.1003 48.7678L19.3644 45.3708ZM90.5588 32.3584C90.3289 33.3947 89.1797 34.6039 88.4327 35.4099C90.7312 36.0433 92.9721 36.8494 95.2131 37.713C94.9833 35.6978 92.6274 33.6826 90.5588 32.3584ZM26.1448 74.4473C24.9956 73.8139 23.8464 73.123 22.7546 72.3745C22.1225 73.6988 23.2718 75.1958 24.5359 75.8867C24.9956 75.3685 25.6277 74.9079 26.1448 74.4473ZM96.6497 46.9254C98.0862 47.5587 99.5227 48.3072 100.844 49.1709C101.821 47.3284 101.189 46.1769 99.2354 44.5071C98.4884 45.3708 97.6265 46.1769 96.6497 46.9254ZM92.1677 49.6891C89.1222 51.1285 84.7552 52.5679 78.4345 54.1801C73.3204 55.4468 60.7364 57.2893 47.2905 60.2257C42.9809 61.1469 31.4887 63.9106 25.8001 68.7471C27.409 70.0138 28.3858 70.3593 30.1096 71.3381C32.4656 69.8411 35.6259 68.4017 40.3952 67.135C48.6696 64.947 54.8179 63.9682 62.2879 62.7591C69.7578 61.55 83.5485 58.6711 91.2483 55.9074C93.6042 55.1013 95.7877 53.9498 97.7989 52.4528C97.3392 51.877 92.3975 49.4588 92.1677 49.6891ZM33.9595 82.105C35.2811 81.3565 36.6028 80.6656 38.0393 80.1474C35.8558 79.2262 33.6722 78.2474 31.4313 77.211C30.5119 77.7867 29.5925 78.4777 28.788 79.2262C30.5119 80.205 32.2357 81.1838 33.9595 82.105ZM26.8918 82.7959C26.8344 84.1778 27.6963 85.4445 29.535 86.9415C29.7649 86.193 30.1671 85.5021 30.6268 84.9263C29.3626 84.2354 28.0985 83.5444 26.8918 82.7959ZM37.2923 57.059C52.462 52.5679 68.3213 51.1861 84.4104 46.9254C78.1472 45.1981 74.6995 44.5071 68.034 45.2556C58.0932 46.4648 48.2674 48.4224 38.6714 51.2437C35.1088 52.3376 16.3764 57.6923 21.7778 65.1773C21.7778 65.2349 24.9956 60.6863 37.2923 57.059ZM94.1214 41.4555C91.2483 40.1889 88.3178 39.1525 85.2723 38.3464C83.606 39.6707 81.7098 40.7646 79.6412 41.5131C83.7209 42.2616 86.7663 43.3556 90.214 44.392C90.9035 44.7374 93.6617 42.0889 94.1214 41.4555ZM101.591 56.1377C101.132 56.5408 100.614 56.9438 100.04 57.3468C96.5922 59.9954 91.1909 62.1257 83.6634 64.1409C68.0915 68.3441 56.7716 68.9774 43.9003 72.1442C41.3146 72.7775 38.7863 73.5836 36.3729 74.62C38.7863 75.8291 41.372 76.9807 44.0152 78.017C49.0144 76.52 54.1284 75.3109 59.2999 74.5048C62.173 73.9866 71.0795 72.4321 77.4576 71.0502C89.1223 68.5744 106.073 63.1621 101.591 56.1377Z"
									fill="#2355D7" />
								<path
									d="M183.588 89.7628H196.402L197.953 80.3201H206.745L208.296 89.7628H221.11L210.307 35.0645H194.448L183.588 89.7628ZM202.32 51.5891L204.676 68.2865H199.964L202.32 51.5891ZM233.12 56.8862C235.131 56.8862 238.923 55.562 238.923 51.5316C238.923 46.7527 234.613 46.4648 233.349 46.4648C230.936 46.4648 228.58 46.983 226.397 48.0194L226.282 36.216C229.844 35.2372 233.579 34.7766 237.257 34.7766C247.542 34.7766 252.197 42.0313 252.197 49.1133C252.197 56.0226 248.174 60.2257 244.382 61.8379V62.3561C248.059 63.5076 253.001 67.0774 253.001 75.4837C253.001 85.79 245.818 91.4901 236.682 91.4901C231.74 91.4901 228.58 90.7416 224.73 88.6688L224.96 77.3261C227.603 78.5353 230.419 79.0534 233.292 78.9959C237.314 78.9959 238.981 76.0019 238.981 73.8139C238.981 70.7623 237.027 68.6896 232.717 68.6896H227.546V56.8862H233.12ZM259.034 35.0645H293.454V89.7628H280.87V48.2497H271.676V89.7628H259.092V35.0645H259.034ZM300.579 89.7628H313.22V71.7411H317.472C329.999 71.7411 333.791 60.456 333.791 53.2589C333.791 46.0617 329.367 35.0645 317.415 35.0645H300.579V89.7628ZM313.22 47.0981H316.208C319.081 47.0981 320.863 48.8254 320.863 53.374C320.863 59.3045 317.817 59.7075 316.208 59.7075H313.163L313.22 47.0981ZM357.178 90.4537C372.118 90.4537 377.175 76.4049 377.175 62.3561C377.175 48.3073 372.118 34.2584 357.178 34.2584C342.238 34.2584 337.182 48.3073 337.182 62.3561C337.182 76.4049 342.238 90.4537 357.178 90.4537ZM357.178 77.211C352.754 77.211 350.455 71.9715 350.455 62.3561C350.455 52.7407 352.754 47.5012 357.178 47.5012C361.603 47.5012 363.901 52.7407 363.901 62.3561C363.901 71.9715 361.603 77.211 357.178 77.211ZM159.167 35.1221H185.025V48.7679H172.038V89.8204H159.167V35.1221ZM383.151 35.1221H393.838L403.319 48.0194L412.858 35.1221H423.546V89.8204H410.962V56.4256L403.377 65.9834L395.792 56.4256V89.8204H383.208L383.151 35.1221Z"
									fill="#2355D7" />
								<path
									d="M432.051 89.7627H447.106C450.381 89.7627 463.999 88.3809 464.057 71.8563C464.057 57.865 453.484 55.4468 446.646 55.4468H444.405V48.192H461.069V35.0645H432.051V89.7627ZM444.405 78.8231V66.3864H446.244C447.738 66.3864 451.702 66.444 451.702 72.0866C451.702 77.8443 447.738 78.8231 446.244 78.8231H444.405ZM509.393 35.0645H521.748V54.7558H530.539V35.0645H542.893V89.7627H530.539V67.8834H521.748V89.7627H509.393V35.0645ZM551.168 35.0645H563.522V54.7558H566.223L573.29 35.0645H586.679L577.025 61.0317L588 89.7627H573.52L566.452 67.7683H563.522V89.7627H551.225L551.168 35.0645ZM466.47 89.8779H479.284L480.835 80.4352H489.627L491.178 89.8779H503.992L493.189 35.1796H477.273L466.47 89.8779ZM485.26 51.7043L487.673 68.4016H482.904L485.26 51.7043Z"
									fill="#2355D7" />
							</g>
							<defs>
								<clipPath id="clip0_335_2698">
									<rect width="588" height="125" fill="white" />
								</clipPath>
							</defs>
						</svg>
					</div>
				</div>
			</div>
		</div>
		<div class="desc" :class="{ 'active': tabs.active == 4 }">
			<div class="container">
				<div class="desc__top">
					<div class="desc__title h1 _bold mh3">
						Как просто купить авто
					</div>
					<div class="desc__text decked mtag">
						On-Line Dealer это торговая площадка автомобилей нового формата, которая позволяет своим клиентам сделать
						процесс покупки автомобиля максимально комфортным и удобным.
					</div>
					<div class="desc__text decked mtag">
						Наша миссия - создать условия и возможности, при которых аудитория продавцов и покупателей получает прозрачный
						и надежный инструмент товарных отношений в автоиндустрии с применением лучших современных практик и
						инструментов. </div>
					<div class="desc__text decked mtag">
						Цель - стать крупнейшей площадкой по продаже автомобилей на территории РФ в периоде 10 лет.</div>
					<div class="desc__text decked mtag">
						Для достижения высоких оценок покупателей и участников рынка On-Line Dealer тщательно подходит к выбору
						партнёров и поставщиков автомобилей. В нашу команду входят люди с высокими требованиями к себе и своему делу,
						обладают отличными навыками и компетенциями, знаниями и опытом, честолюбием и заслуживающей уважение любви к
						клиентам. Поэтому On-Line Dealer нацелен на создание и развитие максимально комфортных для Вас условий покупки
						автомобиля:
					</div>
				</div>
				<div class="desc__opener">
					<div class="desc__opener-text">
						<ul>
							<li>Удобный мобильный сервис банка </li>
							<li>Выгодные условия кредитования </li>
							<li>Большой выбор автомобилей </li>
							<li>Выдача автомобиля в удобном для Вас формате </li>
							<li>Комфортные условия для продажи своего поддержанного автомобиля </li>
							<li>Разнообразие страховых продуктов </li>
							<li>Персональная поддержка 24 часа и много другое </li>
						</ul>
					</div>
					<div class="desc__small">
					</div>
				</div>
				<div class="desc__common">
					<div class="h4 _bold desc__subtitle">Спасибо, что выбираете нас!</div>
					<div class="desc__standard">Все Ваши замечания и предложения не останутся без внимания. Форма обратной связи на первой странице нашего сайта.
						<br><br>
						С Уважением, команда On-Line Dealer.
					</div>
				</div>
			</div>
		</div>
	</div>
</template>

<script setup>
import { ref } from 'vue';

const tabs = ref({
	active: 1,
})
</script>
